app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."provider" = 'google_login' AND "users"."uid" = '109544142292455308130' LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth["provider"], :uid => auth["uid"]).first_or_initialize(
      :provider_email => auth["info"]["email"],
      :name => auth["info"]["name"],
    )